# Задание 8.

number = int(input('Введите число: ')) # количество чисел в последовательности Фибоначчи

row = [1, 1]
for i in range(1, number - 1):
    row.append(row[-1] + row[-2])
print(*row)

# Введите число: 1
# 1 1

# Введите число: 5
# 1 1 2 3 5

# Введите число: 20
# 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765