# Задание 3

number = int(61) # Вводим любое число и выражаем его в минутах

print (f'{number} минут - это {number // 60} часов и {number % 60} минут')

# Выводим в терминале сообщение - чтобы узнать часы, число делим на 60, а чтобы вычислить оставшиеся минуты - узнаем остаток. Получаем: 61 минут - это 1 часов и 1 минут